// app/newspg/N1/page.tsx
"use client";

import Image from "next/image";

export default function NewsPageN2() {
  return (
   <div className="max-w-3xl mx-auto px-4 py-10 text-right" dir="rtl">

  <div className="max-w-3xl mx-auto px-6 py-12 text-right bg-white rounded-lg shadow-lg" dir="rtl">
  <h1 className="text-3xl font-extrabold text-blue-900 mb-8 tracking-wide">بيان رسمي</h1>

  <Image
    src="/news/n2.jpg"
    alt="الهيئة العامة للاتصالات - بيان"
    width={768}
    height={960}
    className="rounded-lg shadow-md mb-10"
  />

  <section className="max-w-4xl mx-auto p-6 space-y-6 text-right leading-relaxed text-gray-800">
      <h1 className="text-2xl font-bold mb-4 text-blue-700">
        الهيئة العامة للاتصالات والمعلوماتية تعلن من مدينة مراكش البدء في الانتقال إلى الإصدار السادس لبروتوكول الإنترنت IPv6
      </h1>
      <p className="text-sm text-gray-600">2024/5/28م</p>

      <p>
        في خطوة هامة نحو تعزيز مكانة ليبيا على خريطة التكنولوجيا العالمية، أعلنت الهيئة العامة للاتصالات والمعلوماتية اليوم الثلاثاء الموافق 2024/5/28م في مدينة مراكش بالمملكة المغربية، عن بدء رحلتها نحو تبني الإصدار السادس لبروتوكول الإنترنت IPv6.
      </p>

      <p>
        جاء ذلك خلال اجتماعات المجلس العربي للإصدار السادس لبروتوكول الإنترنت وفعاليات Africa IP Gala 2024 التي تستضيفها مدينة مراكش.
      </p>

      <p>
        تأتي هذه الخطوة تأكيدًا على التزام الهيئة بتنفيذ قرار السيد رئيس الهيئة العامة للاتصالات والمعلوماتية رقم 41 لسنة 2024، الذي يهدف إلى إنشاء فريق لإعداد إستراتيجية الانتقال للإصدار السادس لبروتوكول الإنترنت ودليل الأرشادات المصاحب لها.
      </p>

      <p>
        وكذلك تعزيزا لمنشور السيد رئيس الهيئة رقم (2) لسنة 2023 بخصوص إيقاف توريد المعدات التي لا تدعم هذا الإصدار.
      </p>

      <p>
        في إطار التأكيد على أهمية هذا الانتقال، قامت الهيئة بالفعل بإجراء اختبارات الإصدار السادس IPv6 داخل مركز بياناتها، وتم تشغيل موقعها الرسمي باستخدام هذا الإصدار وبذلك، تصبح الهيئة العامة للاتصالات والمعلوماتية أول جهة حكومية في ليبيا تتمكن من الوصول إلى شبكة الإنترنت مباشرة عبر هذا الإصدار، مما يعد إنجاز هاماً يسهم في تعزيز مكانة ليبيا على خريطة التكنولوجيا العالمية.
      </p>

      <p>
        كما تؤكد الهيئة العامة للاتصالات والمعلوماتية على أن هذا الانتقال يمثل ضرورة حتمية لمواكبة التطورات المتسارعة في مجال الاتصالات وتكنولوجيا المعلومات، ولضمان توفير خدمات إنترنت آمنة وموثوقة تلبي احتياجات المستخدمين المتزايدة.
      </p>

      <p>
        والجدير بالذكر أن الإصدار السادس IPv6 يتمتع بمزايا متعددة تفوق الإصدار الرابع، مثل سعة أكبر لعناوين الإنترنت وأمان محسن وكفاءة أعلى في نقل البيانات.
      </p>

      <p>
        وختاماً تدعو الهيئة العامة للاتصالات والمعلوماتية جميع الجهات والمؤسسات في ليبيا إلى التعاون معها في عملية الانتقال إلى الإصدار السادس IPv6، وذلك لضمان استفادة الجميع من مزاياه وفوائده.
      </p>
    </section>
</div>

</div>
  );
}
