// import {
//     Accordion,
//     AccordionContent,
//     AccordionItem,
//     AccordionTrigger,
//   } from "@/components/ui/accordion"
//   import { useLanguage } from "@/contexts/language-context"

//   const { isArabic } = useLanguage();

  
//   export default function TOS() {
//     return (
//     <div className={`min-h-screen bg-white ${isArabic ? "rtl" : "ltr"}`}>
//       <main className="max-w-7xl mx-auto px-4 py-8">
//             <Accordion type="single" collapsible>
//                 <AccordionItem value="item-1">
//                     <AccordionTrigger>إتفاقية الاستخدام</AccordionTrigger>
//                         <AccordionContent>
//                         إن الموقع الإلكتروني الخاص بالهيئة العامة للاتصالات والمعلوماتية وما فيه من خدمات ومواقع أخرى متشعبة منه متاح لاستخدامك الشخصي، ولا تتحمل الهيئة العامة للاتصالات والمعلوماتية أي مسؤولية تجاه أي جهة اتخذت أو ستتخذ أي قرار بناءً على المحتوى الوارد في هذا الموقع أو المواقع التابعة لها. كما أنها غير مسؤولة عن محتويات المواقع الإلكترونية التي لا تتبعها ولكنها أُدرجت في موقع الهيئة العامة للاتصالات والمعلوماتية، ولا تتحمل مسؤولية اتخاذ أي جهة لأي قرار أو تصرف بناءً على هذه المحتويات والمعلومات المنشورة في تلك المواقع الإلكترونية يخضع دخولك واستخدامك لموقع الهيئة العامة للاتصالات والمعلوماتية لبنود وشروط الاستخدام وللأنظمة المعمول بها في ليبيا، وكذلك يعد وصولك ودخولك إلى الموقع وخدماته موافقة دون قيد أو شرط على بنود وشروط الاستخدام، سواءً كنت مستخدماً مسجلاً أم لا، وتسري هذه الموافقة اعتباراً من تاريخ أول استخدام لك لهذا الموقع. ويصبح أي تعديل لهذه البنود والشروط نافذاً فور إعلانه، ويعني استمرارك في استخدام هذا الموقع بعد إعلان أي تعديل قبول تام لذلك التعد
//                     </AccordionContent>
//                 </AccordionItem>
//             </Accordion>
//         </main>
//     </div>
//     )
//   }